tutorials/lagrangian/reactingParcelFilmFoam/evaporationTest/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/polyMesh";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    //back
    (    0     0    0)
    ( 1.22     0    0)
    (    0  0.51    0)
    ( 1.22  0.51    0)

    // front
    (    0     0  0.2)
    ( 1.22     0  0.2)
    (    0  0.51  0.2)
    ( 1.22  0.51  0.2)
);

blocks
(
    hex (0 1 3 2 4 5 7 6 ) (80 40 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    wall right
    (
        (1 5 7 3)
    )

    wall top
    (
        (4 5 7 6)
    )

    wall left
    (
        (4 0 2 6)
    )

    wall frontAndBack
    (
        (7 3 2 6)
        (0 4 5 1)
    )

    wall filmWalls
    (
        (0 1 3 2)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
