tutorials/lagrangian/reactingParcelFilmFoam/evaporationTest/constant/surfaceFilmProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      SurfaceFilmProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFilmModel thermoSingleLayer;

filmRegionName  wallFilmRegion;

active          true;

kinematicSingleLayerCoeffs
{
    thermoModel constant;
    rho0        rho0 [1 -3 0 0 0] 1000;
    mu0         mu0 [1 -1 -1 0 0] 1e-3;
    sigma0      sigma0 [1 0 -2 0 0] 0.07;

    deltaStable deltaStable [0 1 0 0 0] 0;
    Cf          0.005;

    injectionModel none;
}

thermoSingleLayerCoeffs
{
    thermoModel singleComponent; // constant
//    thermoModel constant; // constant
    liquid      H2O;
//    rho0        rho0 [1 -3 0 0 0] 1000;
//    mu0         mu0 [1 -1 -1 0 0] 1e-3;
//    sigma0      sigma0 [1 0 -2 0 0] 0.07;
//    cp0         cp0 [0 2 -2 -1 0] 4187;

    deltaStable deltaStable [0 1 0 0 0] 0;
    Cf          0.005;
    htcw        htcw [1 0 -3 -1 0] 1e3; // 0.0;
    htcs        htcs [1 0 -3 -1 0] 1e-8; // 0.0;

    rho0         rho [1 -3 0 0 0] 1000;
    mu0          mu [1 -1 -1 0 0] 1e-3;
    sigma0       sigma [1 0 -2 0 0] 0.07;
    cp0          cp [0 2 -2 -1 0] 4187;
    kappa0      kappa0 [1 1 -3 -1 0] 0.6;

    injectionModel none;

    phaseChangeModel standardPhaseChange; // only option currently available
    //phaseChangeModel none; // only option currently available
    standardPhaseChangeCoeffs
    {
        Tb               374.8;
        deltaMin         1e-8; // mass transfer turned off when film thickness below this value
        L                1; // length scale used in mean Nusselt and Sherwood correlation
    }

    upperSurfaceModels
    {
        //heatTransferModel mappedConvectiveHeatTransfer;  // gets htc from gas-phase calculation
        heatTransferModel constant;  // submodels/thermo/heatTransferModel/constantHeatTransfer/constantHeatTransfer.C
        constantCoeffs
        {
            c0                1000;
        }
    }

    lowerSurfaceModels
    {
        heatTransferModel constant;  // submodels/thermo/heatTransferModel/constantHeatTransfer/constantHeatTransfer.C
        constantCoeffs
        {
//            c0                50;
            c0                1000;
        }
    }
    
}

