tutorials/lagrangian/reactingParcelFilmFoam/evaporationTest/Allrun
#!/bin/sh
. $WM_PROJECT_DIR/bin/tools/RunFunctions

./Allrun.pre

runApplication reactingParcelFilmFoam
